In [1]:
import pandas as pd

#### DataFrame
Un DataFrame representa una tabla rectangular de datos y contiene una colección ordenada
y nombrada de columnas, cada una de las cuales puede ser un tipo de valor diferente
(numérico, cadena, booleano, etc.).

In [9]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [10]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [11]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [12]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [13]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [14]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [15]:
frame2
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [16]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [17]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [18]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [25]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [26]:
del frame2["eastern"]
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [27]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [33]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 1.3}}

In [34]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     1.3

In [35]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   1.3

In [36]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     1.3
2003   NaN     NaN

In [37]:
pdata = {"Ohio": frame3["Ohio"][:-1],"Nevada": frame3["Nevada"][:2]}
# frame3["Ohio"][:-1]: Extrae todos los valores de la columna “Ohio”
# excepto el último valor.
# frame3["Nevada"][:2]:Extrae los primeros dos valores de la columna “Nevada”
# en el DataFrame frame3.
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64,
 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [38]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [39]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     1.3

In [40]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 1.3]])

In [41]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

In [43]:
import numpy as np
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int32

In [44]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [45]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [46]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [47]:
obj2.index is labels

True

In [48]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     1.3

In [49]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [50]:
"Ohio" in frame3.columns

True

In [51]:
2003 in frame3.index

False

In [52]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [53]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [54]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [55]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [56]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [59]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=["a", "c", "d"],columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [60]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [61]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [62]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [63]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [64]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [65]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [66]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [67]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Ohio", "Colorado", "Utah", "New York"],
columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [70]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [71]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### OTRO EJEMPLO

In [72]:
import pandas as pd

# Crear el DataFrame inicial con los países europeos mencionados
data = {
    'País': ['Austria', 'Bélgica', 'Chipre', 'Dinamarca', 'Francia', 'Eslovenia', 'Irlanda'],
    'Población': [8.9, 11.5, 1.2, 5.8, 67.1, 2.1, 4.9],  # en millones
    'Área': [83.9, 30.5, 9.3, 42.9, 551.7, 20.3, 70.3],  # en miles de km^2
    'Capital': ['Viena', 'Bruselas', 'Nicosia', 'Copenhague', 'París', 'Liubliana', 'Dublín']
}

df = pd.DataFrame(data)
print(df)

        País  Población   Área     Capital
0    Austria        8.9   83.9       Viena
1    Bélgica       11.5   30.5    Bruselas
2     Chipre        1.2    9.3     Nicosia
3  Dinamarca        5.8   42.9  Copenhague
4    Francia       67.1  551.7       París
5  Eslovenia        2.1   20.3   Liubliana
6    Irlanda        4.9   70.3      Dublín

In [73]:
print(df)

        País  Población   Área     Capital
0    Austria        8.9   83.9       Viena
1    Bélgica       11.5   30.5    Bruselas
2     Chipre        1.2    9.3     Nicosia
3  Dinamarca        5.8   42.9  Copenhague
4    Francia       67.1  551.7       París
5  Eslovenia        2.1   20.3   Liubliana
6    Irlanda        4.9   70.3      Dublín

In [74]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   País       7 non-null      object
 1   Población  7 non-null      float64
 2   Área       7 non-null      float64
 3   Capital    7 non-null      object
dtypes: float64(2), object(2)
memory usage: 356.0+ bytes
None

In [75]:
print(df.describe())

       Población        Área
count    7.00000    7.000000
mean    14.50000  115.557143
std     23.47204  194.143099
min      1.20000    9.300000
25%      3.50000   25.400000
50%      5.80000   42.900000
75%     10.20000   77.100000
max     67.10000  551.700000

In [76]:
print(df['Población'])

0     8.9
1    11.5
2     1.2
3     5.8
4    67.1
5     2.1
6     4.9
Name: Población, dtype: float64

In [77]:
print(df[df['Población'] > 5])

        País  Población   Área     Capital
0    Austria        8.9   83.9       Viena
1    Bélgica       11.5   30.5    Bruselas
3  Dinamarca        5.8   42.9  Copenhague
4    Francia       67.1  551.7       París

In [78]:
df['Densidad'] = df['Población'] * 1000 / df['Área']  # población en millones y área en miles de km^2
print(df)

        País  Población   Área     Capital    Densidad
0    Austria        8.9   83.9       Viena  106.078665
1    Bélgica       11.5   30.5    Bruselas  377.049180
2     Chipre        1.2    9.3     Nicosia  129.032258
3  Dinamarca        5.8   42.9  Copenhague  135.198135
4    Francia       67.1  551.7       París  121.624071
5  Eslovenia        2.1   20.3   Liubliana  103.448276
6    Irlanda        4.9   70.3      Dublín   69.701280

In [79]:
df_sorted = df.sort_values(by='Población', ascending=False)
print(df_sorted)

        País  Población   Área     Capital    Densidad
4    Francia       67.1  551.7       París  121.624071
1    Bélgica       11.5   30.5    Bruselas  377.049180
0    Austria        8.9   83.9       Viena  106.078665
3  Dinamarca        5.8   42.9  Copenhague  135.198135
6    Irlanda        4.9   70.3      Dublín   69.701280
5  Eslovenia        2.1   20.3   Liubliana  103.448276
2     Chipre        1.2    9.3     Nicosia  129.032258

In [80]:
print(df[['País', 'Capital']])

        País     Capital
0    Austria       Viena
1    Bélgica    Bruselas
2     Chipre     Nicosia
3  Dinamarca  Copenhague
4    Francia       París
5  Eslovenia   Liubliana
6    Irlanda      Dublín

#### Indexación, selección y filtrado
La indexación de series ( obj[...] ) funciona de forma análoga a la indexación de arrays de
NumPy, con la diferencia de que puedes utilizar los valores índice de la serie en lugar de sólo
enteros.

In [82]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [83]:
obj["b"]

1.0

In [84]:
obj[1]

C:\Users\CursosTardes\AppData\Local\Temp\ipykernel_17732\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [85]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [86]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [87]:
obj[[1, 3]]

C:\Users\CursosTardes\AppData\Local\Temp\ipykernel_17732\2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [88]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [89]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [92]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
obj1

2    1
0    2
1    3
dtype: int64

In [93]:
obj2

a    1
b    2
c    3
dtype: int64

In [94]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [95]:
obj2[[0, 1, 2]]

C:\Users\CursosTardes\AppData\Local\Temp\ipykernel_17732\2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [96]:
obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int32')] are in the [index]"

In [97]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [98]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [99]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [100]:
obj2

a    1
b    2
c    3
dtype: int64

In [101]:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [102]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Ohio", "Colorado", "Utah", "New York"],
columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [104]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [105]:
data[:2]
# selecciona las primeras dos filas del DataFrame.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [110]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [112]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [113]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [114]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [115]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [116]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [117]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [118]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [119]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [120]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [121]:
data.loc[:"Utah", "two"]
# Devuelve los valores de la columna "two"
# para todas las filas desde el inicio
# hasta la fila con la etiqueta "Utah"

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [122]:
data.iloc[:, :3][data.three > 5]
# Muestra las filas que cumplen
# la condición data.three > 5
# para las columnas 'one', 'two'
# y 'three'
# Para mayor claridad ejecute
# data.iloc[:, :3] y luego
# data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [123]:
data.three >= 2

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [124]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Errores en la indexación de números enteros

In [126]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [127]:
ser[-1]

KeyError: -1

In [128]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [129]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1]

C:\Users\CursosTardes\AppData\Local\Temp\ipykernel_17732\821879068.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [130]:
ser.iloc[-1]

2.0

In [131]:
ser[:2]

0    0.0
1    1.0
dtype: float64

#### Errores de la indexación encadenada

In [132]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [133]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [134]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [135]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [136]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [137]:
data.loc[data.three == 5]
# La condición data.three == 5
# crea una Serie booleana que
# tiene True para las filas
# donde el valor en la columna "three"
# es igual a 5 y False para las demás filas

      one  two  three  four
Utah    5    5      5     5

In [138]:
data.loc[data.three == 5]["three"] = 6

C:\Users\CursosTardes\AppData\Local\Temp\ipykernel_17732\867481848.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6

In [139]:
data.loc[data.three == 5, "three"] = 6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3